Drexyia/Drexyia.WebSvc.Wsdl.Tests/TestData/Drexyia.WebSvc.Wsdl.Tests/helloworld-usingdatacontract-request.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <HelloWorldUsingDataContract xmlns="http://tempuri.org/">
      <composite>
        <BoolValue xmlns="http://schemas.datacontract.org/2004/07/Drexyia.WebSvc.Process.Tests.Server">boolean</BoolValue>
        <StringValue xmlns="http://schemas.datacontract.org/2004/07/Drexyia.WebSvc.Process.Tests.Server">string</StringValue>
      </composite>
    </HelloWorldUsingDataContract>
  </soap:Body>
</soap:Envelope>